JCyl/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
transportModel  Newtonian;

//nu              nu [ 0 2 -1 0 0 0 0 ] 0.01;
//nu              nu [ 0 2 -1 0 0 0 0 ] 0.00002;
  nu              nu [ 0 2 -1 0 0 0 0 ] 0.000002;

// ************************************************************************* //
